package Lesson2_HW;

// Вывести на экран квадраты чисел от 10 до 20 включительно

public class Task2_6 {
    public static void main(String[] args) {
        for (int i = 10; i <= 20; i++) {
            System.out.print(i * i + " ");
        }
    }
}
